# Brewfile — run `brew bundle` to install everything
# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"

# Shell
brew "zsh"
brew "stow"

# Editor
brew "vim"

# Terminal multiplexer
brew "tmux"

# Version control
brew "git"
brew "gh"

# Search / navigation
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "the_silver_searcher"

# Code navigation
brew "universal-ctags"

# Data / utilities
brew "jq"
brew "curl"
brew "wget"
brew "make"

# Version manager (ruby, node, python)
brew "mise"

# Node — required for claude-code
brew "node"
